IDENTIFICATION DIVISION.
PROGRAM-ID. BankFileIssue.

DATA DIVISION.
FILE SECTION.
FD TRANSACTION-FILE.
01 TRANS-RECORD.
   05 ACCOUNT-NUMBER   PIC 9(6).
   05 TRANSACTION-AMT  PIC 9(5).

WORKING-STORAGE SECTION.
01 WS-ACCOUNT-NUMBER  PIC 9(6).
01 WS-TRANSACTION-AMT PIC 9(5).

PROCEDURE DIVISION.
    OPEN INPUT TRANSACTION-FILE.
    
    READ TRANSACTION-FILE INTO TRANS-RECORD
        AT END
            DISPLAY "End of File."
        NOT AT END
            DISPLAY "Processing Record."
            MOVE ACCOUNT-NUMBER TO WS-ACCOUNT-NUMBER
            MOVE TRANSACTION-AMT TO WS-TRANSACTION-AMT
            DISPLAY "Account: " WS-ACCOUNT-NUMBER " Amount: " WS-TRANSACTION-AMT
    END-READ.
    
    CLOSE TRANSACTION-FILE.
    
    STOP RUN.
